{
  "main": {
    "name":"Zachary Knopp",
    "description":"I'm a creator who is fascinated by motion. I think agile robotics will pave the way to adaptable automation and I want to be one of the people driving it.",
    "image":"profilepic.jpg",
    "bio":"I like transforming ideas into tangible creations. For my master’s thesis, I built computer vision algorithms to reduce waste in industrial potato peeling processes. I have also developed several robotic platforms for controls research. Lately, I have been building scalable web applications that enable businesses to make data-driven management decisions.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "zachary@zknopp.com",
    "phone": "+1 (506) 259-8897",
    "address":{
      "street":"39 Bulman Drive",
      "city":"Moncton",
      "state":"NB",
      "zip": "E1G 1G9"
    },
    "website": "https://www.zknopp.com",
    "resumedownload": "https://drive.google.com/file/d/1yeabzegr4R1HUUFmO8MYN_-yvWJNV9wY/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/profile.php?id=100006724546912",
        "className":"fa fa-facebook"
      },
      {
        "name": "stackoverflow",
        "url": "https://stackoverflow.com/users/5631798/zack-knopp",
        "className": "fa fa-stack-overflow"
      },
      {
        "name":"github",
        "url":"https://github.com/ZackKnopp",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"University of New Brunswick",
        "degree":"Master of Science in Mechanical Engineering",
        "graduated":"May 2016",
        "description":"I was given the opportunity to explore my interests, which led me to performing research in computer vision and robotics. My thesis work involved creating computer vision algorithms for reducing waste in industrial potato peeling processes. Also during my degree, I received an NSERC award, I wrote three conference papers, acted as a teaching assistant for multiple courses, and built a two-wheeled, inverted pendulum robot from the ground up."
      },
      {
        "school":"University of New Brunswick",
        "degree":"Bachelor of Science in Mechanical Engineering",
        "graduated":"May 2014",
        "description":"At the start of my degree, I joined the varsity soccer team and we won our division, which sent us to nationals. Then I started running on the track team and I became a CIS Academic All-Canadian. I also spent some time working on the Formula SAE team, although we never got to competition. In my fourth year, I became a research assistant for Dr. Rickey Dubay, who mentored my senior design team as we built a pick-and-place robotic arm."
      }
    ],
    "work":[
      {
        "company":"Symplicity Designs",
        "title":"Senior Software Engineer",
        "years":"Nov 2016 - Present",
        "description":"At Symplicity, I developed an application that enables businesses to make data-driven management decisions. Duties included deciding on the tech stacks, designing the UI/UX and building the database, server and client layers."
      },
      {
        "company": "Cold Furnace Studios",
        "title": "Software Developer",
        "years": "Jul 2016 - Nov 2016",
        "description": "At Cold Furnace Studios, I assembled a playable demo as the foundation for a AAA video game. I also developed coding standards, naming conventions and branching strategies so the project would be maintainable."
      },
      {
        "company":"Kendrion GmbH",
        "title":"R&D Engineering Intern",
        "years":"Apr 2013 - Sep 2013",
        "description":"At Kendrion, I designed several production tools. Work included realizing the problem, planning a concept, building SolidWorks models, creating detailed engineering drawings and communicating with technicians to ensure proper construction."
      }
    ],
    "skillmessage": "I like to tinker with things, learning as I go. These are some of the skills and technologies that have stuck with me.",
    "skills":[
      {
        "title":"Computer:",
        "skills":"MATLAB, Python, C/C++, Linux, Javascript, HTML, CSS, Reactjs, Angularjs, Google Cloud Suite, Firebase, OAuth, SQL, Git, SVN, Unity Engine, Unreal Engine."
      },
      {
        "title": "Analytical:",
        "skills": "Electromechanical design, control law derivation, system identification, predictive control, computer vision algorithm development, troubleshooting robotic systems, UI/UX, app development."
      },
      {
        "title": "Familiar With:",
        "skills": "Deep learning using Numpy and Theano, OpenCV. Currently taking courses on ROS and underactuated robotics."
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Potato Peeling",
        "category":"Developed algorithms to analyze peeled potatos as a first step towards closed-loop control of an industrial potato peeler.",
        "image":"potatoes.gif",
        "url":"https://youtu.be/EIToCavY4bA"
      },
      {
        "title":"Two-Wheeled Bot",
        "category":"Designed and built a two-wheeled inverted pendulum robot as a test bed for nonlinear controllers.",
        "image":"two-wheeled.gif",
        "url":"https://youtu.be/N1XlWGzX1h8"
      },
      {
        "title":"Visual Control of a Robotic Arm",
        "category":"Controlled a robotic arm using a camera to overcome the negative effects of backlash.",
        "image":"visual-control.png",
        "url":"https://drive.google.com/file/d/1rbsURdom1NKjeH0MIG8QMQG3l_dws_Ut/view?usp=sharing"
      },
      {
        "title":"Haptic Maze",
        "category":"Investigated how people learn through touch, using a force feedback maze.",
        "image":"haptic-maze.gif",
        "url":"https://docs.google.com/presentation/d/e/2PACX-1vQpu-T4ulP2rUTLbGEaYIuTKmXFCG1f42zYkrntQl7eDVDAJJpJLsibVZMTR41z23H--Q0r2aTLF1DO/pub?start=false&loop=false&delayms=3000"
      },
      {
        "title":"2.5DOF Manipulator",
        "category":"Designed, fabricated and controlled a 2DOF robotic manipulator with a pneumatic gripper.",
        "image":"2dof.jpg",
        "url":"https://drive.google.com/file/d/1jhpwhYcdwSQPc9HZFSuMkm-_aBhhXmyW/view?usp=sharing"
      },
      {
        "title":"Wall-Following Robot",
        "category":"Created a simple wall-following robot for ECE4333.",
        "image":"wall-follower.gif",
        "url":"https://www.youtube.com/watch?v=spNo7-IWcVI&list=PLBJZoQiK4dllhXff1PXucHwWSMKwOfE_H"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
